=========
aggregate
=========

aggregate count

---

(query
  (aggregate_command
    (key
      (identifier))))

============
aggregate as
============

aggregate count as cnt

---

(query
  (aggregate_command
    aggregation: (key
      (identifier))
    alias: (key
      (identifier))))

====================
aggregate as keypath
====================

aggregate count as cnt.asd

---

(query
  (aggregate_command
    aggregation: (key
      (identifier))
    alias: (field_expression
      expression: (key
        (identifier))
      field: (field))))

==================
aggregate multiple
==================

aggregate count, count2

---

(query
  (aggregate_command
    aggregation: (key
      (identifier))
    aggregation: (key
      (identifier))))

==========================
aggregate multiple with as
==========================

aggregate count as cnt, count2 as cnt2

---

(query
  (aggregate_command
    aggregation: (key
      (identifier))
    alias: (key
      (identifier))
    aggregation: (key
      (identifier))
    alias: (key
      (identifier))))

===============================
aggregate multiple with some as
===============================

aggregate count, count2 as cnt2

---

(query
  (aggregate_command
    aggregation: (key
      (identifier))
    aggregation: (key
      (identifier))
    alias: (key
      (identifier))))
