=========
aggregate
=========

aggregate count

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key))))

============
aggregate as
============

aggregate count as cnt

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key)
      alias: (key))))

====================
aggregate as keypath
====================

aggregate count as cnt.asd

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key)
      alias: (field_expression
        expression: (key)
        field: (field)))))

==================
aggregate multiple
==================

aggregate count, count2

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key))
    aggregation: (aliased_expression
      expression: (key))))

==========================
aggregate multiple with as
==========================

aggregate count as cnt, count2 as cnt2

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key)
      alias: (key))
    aggregation: (aliased_expression
      expression: (key)
      alias: (key))))

===============================
aggregate multiple with some as
===============================

aggregate count, count2 as cnt2

---

(query
  (aggregate_command
    aggregation: (aliased_expression
      expression: (key))
    aggregation: (aliased_expression
      expression: (key)
      alias: (key))))
