======
bottom
======

bottom 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (key)
    orderby: (call_expression
      function: (ident)
      arguments: (arguments))))

=================
bottom with alias
=================

bottom 10 user as u by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (key)
    alias: (key)
    orderby: (call_expression
      function: (ident)
      arguments: (arguments))
    alias: (key)))

============================
bottom with multiple groupby
============================

bottom 10 user, user2 by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (key)
    groupby: (key)
    orderby: (call_expression
      function: (ident)
      arguments: (arguments))))

=======================================
bottom with multiple groupby with alias
=======================================

bottom 10 user as u, user2 as u2 by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (key)
    alias: (key)
    groupby: (key)
    alias: (key)
    orderby: (call_expression
      function: (ident)
      arguments: (arguments))
    alias: (key)))

=========
top alias
=========

top 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (key)
    orderby: (call_expression
      function: (ident)
      arguments: (arguments))))
