======
bottom
======

bottom 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (keypath
      (ident))
    orderby: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

=================
bottom with alias
=================

bottom 10 user as u by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (keypath
      (ident))
    alias: (keypath
      (ident))
    orderby: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))))

============================
bottom with multiple groupby
============================

bottom 10 user, user2 by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (keypath
      (ident))
    groupby: (keypath
      (ident))
    orderby: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

=======================================
bottom with multiple groupby with alias
=======================================

bottom 10 user as u, user2 as u2 by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (keypath
      (ident))
    alias: (keypath
      (ident))
    groupby: (keypath
      (ident))
    alias: (keypath
      (ident))
    orderby: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))))

=========
top alias
=========

top 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (keypath
      (ident))
    orderby: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))
