======
bottom
======

bottom 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (expr
      (keypath
        (ident)))
    orderby: (expr
      (function
        (ident)))))

=================
bottom with alias
=================

bottom 10 user as u by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (expr
      (keypath
        (ident)))
    alias: (keypath
      (ident))
    orderby: (expr
      (function
        (ident)))
    alias: (keypath
      (ident))))

============================
bottom with multiple groupby
============================

bottom 10 user, user2 by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (expr
      (keypath
        (ident)))
    groupby: (expr
      (keypath
        (ident)))
    orderby: (expr
      (function
        (ident)))))

=======================================
bottom with multiple groupby with alias
=======================================

bottom 10 user as u, user2 as u2 by count() as c

---

(query
  (bottom_command
    limit: (number)
    groupby: (expr
      (keypath
        (ident)))
    alias: (keypath
      (ident))
    groupby: (expr
      (keypath
        (ident)))
    alias: (keypath
      (ident))
    orderby: (expr
      (function
        (ident)))
    alias: (keypath
      (ident))))

=========
top alias
=========

top 10 user by count()

---

(query
  (bottom_command
    limit: (number)
    groupby: (expr
      (keypath
        (ident)))
    orderby: (expr
      (function
        (ident)))))
