======
choose
======

choose path

---

(query
  (choose_command
    keypath: (key
      (identifier))))

==========================
choose with multiple paths
==========================

choose path, path2

---

(query
  (choose_command
    keypath: (key
      (identifier))
    keypath: (key
      (identifier))))

=================
choose with alias
=================

choose path as alias

---

(query
  (choose_command
    keypath: (key
      (identifier))
    alias: (key
      (identifier))))

=====================================
choose with multiple paths with alias
=====================================

choose path as alias, path2 as alias2

---

(query
  (choose_command
    keypath: (key
      (identifier))
    alias: (key
      (identifier))
    keypath: (key
      (identifier))
    alias: (key
      (identifier))))

============
select alias
============

select path

---

(query
  (choose_command
    keypath: (key
      (identifier))))
