======
choose
======

choose path

---

(query
  (choose_command
    keypath: (keypath
      (ident))))

==========================
choose with multiple paths
==========================

choose path, path2

---

(query
  (choose_command
    keypath: (keypath
      (ident))
    keypath: (keypath
      (ident))))

=================
choose with alias
=================

choose path as alias

---

(query
  (choose_command
    keypath: (keypath
      (ident))
    alias: (keypath
      (ident))))

=====================================
choose with multiple paths with alias
=====================================

choose path as alias, path2 as alias2

---

(query
  (choose_command
    keypath: (keypath
      (ident))
    alias: (keypath
      (ident))
    keypath: (keypath
      (ident))
    alias: (keypath
      (ident))))

============
select alias
============

select path

---

(query
  (choose_command
    keypath: (keypath
      (ident))))
