=======
countby
=======

countby expr

---

(query
  (countby_command
    expr: (key)))

==================
countby with alias
==================

countby expr as e

---

(query
  (countby_command
    expr: (key)
    alias: (key)))

=================
countby with into
=================

countby expr into path

---

(query
  (countby_command
    expr: (key)
    into: (key)))

===========================
countby with alias and into
===========================

countby expr as a into path

---

(query
  (countby_command
    expr: (key)
    alias: (key)
    into: (key)))
