=======
countby
=======

countby expr

---

(query
  (countby_command
    expression: (aliased_expression
      expression: (key))))

==================
countby with alias
==================

countby expr as e

---

(query
  (countby_command
    expression: (aliased_expression
      expression: (key)
      alias: (key))))

=================
countby with into
=================

countby expr into path

---

(query
  (countby_command
    expression: (aliased_expression
      expression: (key))
    into: (key)))

===========================
countby with alias and into
===========================

countby expr as a into path

---

(query
  (countby_command
    expression: (aliased_expression
      expression: (key)
      alias: (key))
    into: (key)))
