========
distinct
========

distinct expr

---

(query
  (distinct_command
    expression: (aliased_expression
      expression: (key))))

===================
distinct with alias
===================

distinct expr as alias

---

(query
  (distinct_command
    expression: (aliased_expression
      expression: (key)
      alias: (key))))

=================
distinct multiple
=================

distinct expr, expr2

---

(query
  (distinct_command
    expression: (aliased_expression
      expression: (key))
    expression: (aliased_expression
      expression: (key))))

============================
distinct multiple with alias
============================

distinct expr1 as alias2, expr2 as alias2

---

(query
  (distinct_command
    expression: (aliased_expression
      expression: (key)
      alias: (key))
    expression: (aliased_expression
      expression: (key)
      alias: (key))))
