========
distinct
========

distinct expr

---

(query
  (distinct_command
    expr: (key
      (identifier))))

===================
distinct with alias
===================

distinct expr as alias

---

(query
  (distinct_command
    expr: (key
      (identifier))
    alias: (key
      (identifier))))

=================
distinct multiple
=================

distinct expr, expr2

---

(query
  (distinct_command
    expr: (key
      (identifier))
    expr: (key
      (identifier))))

============================
distinct multiple with alias
============================

distinct expr1 as alias2, expr2 as alias2

---

(query
  (distinct_command
    expr: (key
      (identifier))
    alias: (key
      (identifier))
    expr: (key
      (identifier))
    alias: (key
      (identifier))))
