=======
numbers
=======

filter 1234567890
| filter -1237823
| filter 1.23
| filter -1.23

---

(query
  (filter_command
    condition: (number))
  (filter_command
    condition: (number))
  (filter_command
    condition: (number))
  (filter_command
    condition: (number)))

=======
strings
=======

filter ''
| filter 'some string'

---

(query
  (filter_command
    condition: (string))
  (filter_command
    condition: (string)))

==========
timestamps
==========

filter @'now'
| filter @'2025-02-16T01:41:07Z'

---

(query
  (filter_command
    condition: (timestamp_literal
     (string)))
  (filter_command
    condition: (timestamp_literal
     (string))))

========
keypaths
========

filter path
| filter path.path2.path3.path4

---

(query
  (filter_command
    condition: (keypath
      (ident)))
  (filter_command
    condition: (keypath
      (ident)
      (ident)
      (ident)
      (ident))))

=========
functions
=========

filter function()
| filter function(arg1, arg2)
| filter keypath.subpath.function(arg1, arg2)
| filter $variable.subpath.function(arg1, arg2)

---

(query
  (filter_command
    condition: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments)))
  (filter_command
    condition: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments
        (keypath
          (ident))
        (keypath
          (ident)))))
  (filter_command
    condition: (call_expression
      function: (keypath
        (ident)
        (ident)
        (ident))
      arguments: (arguments
        (keypath
          (ident))
        (keypath
          (ident)))))
  (filter_command
    condition: (call_expression
      function: (variable
        (keypath
          (ident)
          (ident)
          (ident)))
      arguments: (arguments
        (keypath
          (ident))
        (keypath
          (ident))))))

=========
intervals
=========

filter 1s
| filter 2m
| filter 3h
| filter 4d

---

(query
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number))))

=========
typecasts
=========

filter path:type
| filter path.path:type

---

(query
  (filter_command
    condition: (type_cast
      keypath: (keypath
        (ident))
      type: (type)))
  (filter_command
    condition: (type_cast
      keypath: (keypath
        (ident)
        (ident))
      type: (type))))

=====
cases
=====

filter case {
  expr -> value
}
| filter case_contains {
  value,
  expr -> value
}

---

(query
  (filter_command
    condition: (case
      value: (keypath
        (ident))
      result: (keypath
        (ident))))
  (filter_command
    condition: (case
      compare: (keypath
        (ident))
      value: (keypath
        (ident))
      result: (keypath
        (ident)))))
