=======
numbers
=======

filter 1234567890
| filter -1237823
| filter 1.23
| filter -1.23

---

(query
  (filter_command
    condition: (number))
  (filter_command
    condition: (number))
  (filter_command
    condition: (number))
  (filter_command
    condition: (number)))

=======
strings
=======

filter ''
| filter 'some string'
| filter `asdfsadf`
| filter `{asd} asdfsadf`

---

(query
  (filter_command
    condition: (string))
  (filter_command
    condition: (string))
  (filter_command
    condition: (format_string
      (string_fragment)))
  (filter_command
    condition: (format_string
      (template_substitution
        (key))
      (string_fragment))))

==========
timestamps
==========

filter @'now'
| filter @'2025-02-16T01:41:07Z'

---

(query
  (filter_command
    condition: (timestamp_literal
     (string)))
  (filter_command
    condition: (timestamp_literal
     (string))))

========
keypaths
========

filter path
| filter path.path2.path3.path4
| filter $d.message

---

(query
  (filter_command
    condition: (key))
  (filter_command
    condition: (property_expression
      expression: (property_expression
        expression: (property_expression
          expression: (key)
          property: (property))
        property: (property))
      property: (property)))
  (filter_command
    condition: (property_expression
      expression: (variable
        (ident))
      property: (property))))

=========
functions
=========

filter function()
| filter function(arg1, arg2)
| filter keypath.subpath.function(arg1, arg2)
| filter $variable.subpath.function(arg1, arg2)
| filter fn().fn()

---

(query
  (filter_command
    condition: (call_expression
      function: (key)
      arguments: (arguments)))
  (filter_command
    condition: (call_expression
      function: (key)
      arguments: (arguments
        (key)
        (key))))
  (filter_command
    condition: (call_expression
      function: (property_expression
        expression: (property_expression
          expression: (key)
          property: (property))
        property: (property))
      arguments: (arguments
        (key)
        (key))))
  (filter_command
    condition: (call_expression
      function: (property_expression
        expression: (property_expression
          expression: (variable
            (ident))
          property: (property))
        property: (property))
      arguments: (arguments
        (key)
        (key))))
  (filter_command
    condition: (call_expression
      function: (property_expression
        expression: (call_expression
          function: (key)
          arguments: (arguments))
        property: (property))
      arguments: (arguments))))

=========
intervals
=========

filter 1s
| filter 2m
| filter 3h
| filter 4d

---

(query
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number)))
  (filter_command
    condition: (interval
      (number))))

=========
typecasts
=========

filter path:type
| filter path.path:type

---

(query
  (filter_command
    condition: (type_cast
      keypath: (key)
      type: (type)))
  (filter_command
    condition: (type_cast
      keypath: (property_expression
        expression: (key)
	property: (property))
      type: (type))))

=====
cases
=====

filter case {
  expr -> value
}
| filter case_contains {
  value,
  expr -> value
}

---

(query
  (filter_command
    condition: (case
      value: (key)
      result: (key)))
  (filter_command
    condition: (case
      compare: (key)
      value: (key)
      result: (key))))
