======
filter
======

filter true

---

(query
  (filter_command
    condition: (true)))

=======
f alias
=======

f false

---

(query
  (filter_command
    condition: (false)))

===========
where alias
===========

where null

---

(query
  (filter_command
    condition: (null)))

======================
filter with expression
======================

filter $d.statusCode >= 500

---

(query
  (filter_command
    condition: (binary_expression
      left: (field_expression
        expression: (key)
        field: (field))
      right: (number))))
