=======
groupby
=======

groupby expr aggregate func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

==========================
groupby multiple groupings
==========================

groupby expr, expr aggregate func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

=====================================
groupby multiple groupings with alias
=====================================

groupby expr as alias, expr as alias aggregate func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    alias: (keypath
      (ident))
    grouping: (keypath
      (ident))
    alias: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

============================
groupby multiple aggregation
============================

groupby expr aggregate func(), func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

==============================
groupby aggregation with alias
==============================

groupby expr aggregate func() as alias

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))))

=======================================
groupby multiple aggregation with alias
=======================================

groupby expr aggregate func() as alias, func() as alias

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))))

=================
groupby agg alias
=================

groupby expr agg func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

=======================
groupby calculate alias
=======================

groupby expr calculate func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

==================
groupby calc alias
==================

groupby expr calc func()

---

(query
  (groupby_command
    grouping: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))
