=======
groupby
=======

groupby expr aggregate func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))))

==========================
groupby multiple groupings
==========================

groupby expr, expr aggregate func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))))

=====================================
groupby multiple groupings with alias
=====================================

groupby expr as alias, expr as alias aggregate func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    alias: (keypath
      (ident))
    grouping: (expr
      (keypath
        (ident)))
    alias: (keypath
      (ident))
    aggregation: (expr
      (function
        name: (ident)))))

============================
groupby multiple aggregation
============================

groupby expr aggregate func(), func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))
    aggregation: (expr
      (function
        name: (ident)))))

==============================
groupby aggregation with alias
==============================

groupby expr aggregate func() as alias

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))
    alias: (keypath
      (ident))))

=======================================
groupby multiple aggregation with alias
=======================================

groupby expr aggregate func() as alias, func() as alias

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))
    alias: (keypath
      (ident))
    aggregation: (expr
      (function
        name: (ident)))
    alias: (keypath
      (ident))))

=================
groupby agg alias
=================

groupby expr agg func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))))

=======================
groupby calculate alias
=======================

groupby expr calculate func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))))

==================
groupby calc alias
==================

groupby expr calc func()

---

(query
  (groupby_command
    grouping: (expr
      (keypath
        (ident)))
    aggregation: (expr
      (function
        name: (ident)))))
