=======
groupby
=======

groupby expr aggregate func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

==========================
groupby multiple groupings
==========================

groupby expr, expr aggregate func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

=====================================
groupby multiple groupings with alias
=====================================

groupby expr as alias, expr as alias aggregate func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    alias: (key
      (identifier))
    grouping: (key
      (identifier))
    alias: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

============================
groupby multiple aggregation
============================

groupby expr aggregate func(), func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

==============================
groupby aggregation with alias
==============================

groupby expr aggregate func() as alias

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))
    alias: (key
      (identifier))))

=======================================
groupby multiple aggregation with alias
=======================================

groupby expr aggregate func() as alias, func() as alias

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))
    alias: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))
    alias: (key
      (identifier))))

=================
groupby agg alias
=================

groupby expr agg func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

=======================
groupby calculate alias
=======================

groupby expr calculate func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))

==================
groupby calc alias
==================

groupby expr calc func()

---

(query
  (groupby_command
    grouping: (key
      (identifier))
    aggregation: (call_expression
      function: (identifier)
      arguments: (arguments))))
