============
multigroupby
============

multigroupby (expr) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (keypath
        (ident)))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

===========================
multigroupby multiple group
===========================

multigroupby (expr, expr), (expr, expr) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (keypath
        (ident))
      grouping: (keypath
        (ident)))
    group: (multigroupby_group
      grouping: (keypath
        (ident))
      grouping: (keypath
        (ident)))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

======================================
multigroupby multiple group with alias
======================================

multigroupby (expr as alias, expr as alias), (expr as alias, expr as alias) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (keypath
        (ident))
      alias: (keypath
        (ident))
      grouping: (keypath
        (ident))
      alias: (keypath
        (ident)))
    group: (multigroupby_group
      grouping: (keypath
        (ident))
      alias: (keypath
        (ident))
      grouping: (keypath
        (ident))
      alias: (keypath
        (ident)))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

======================================
multigroupby with multiple aggregation
======================================

multigroupby (expr) aggregate count(), count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (keypath
        (ident)))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))))

=================================================
multigroupby with multiple aggregation with alias
=================================================

multigroupby (expr) aggregate count() as alias, count() as alias

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (keypath
        (ident)))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))
    aggregation: (call_expression
      function: (keypath
        (ident))
      arguments: (arguments))
    alias: (keypath
      (ident))))
