============
multigroupby
============

multigroupby (expr) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key)))
    aggregation: (aliased_expression
      expression: (call_expression
        function: (key)
        arguments: (arguments)))))

===========================
multigroupby multiple group
===========================

multigroupby (expr, expr), (expr, expr) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key))
      grouping: (aliased_expression
        expression: (key)))
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key))
      grouping: (aliased_expression
        expression: (key)))
    aggregation: (aliased_expression
      expression: (call_expression
        function: (key)
        arguments: (arguments)))))

======================================
multigroupby multiple group with alias
======================================

multigroupby (expr as alias, expr as alias), (expr as alias, expr as alias) aggregate count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key)
        alias: (key))
      grouping: (aliased_expression
        expression: (key)
        alias: (key)))
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key)
        alias: (key))
      grouping: (aliased_expression
        expression: (key)
        alias: (key)))
    aggregation: (aliased_expression
      expression: (call_expression
        function: (key)
        arguments: (arguments)))))

======================================
multigroupby with multiple aggregation
======================================

multigroupby (expr) aggregate count(), count()

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key)))
    aggregation: (aliased_expression
      expression: (call_expression
        function: (key)
        arguments: (arguments)))
    aggregation: (aliased_expression
      expression: (call_expression
        function: (key)
        arguments: (arguments)))))

=================================================
multigroupby with multiple aggregation with alias
=================================================

multigroupby (expr) aggregate count() as alias, count() as alias

---

(query
  (multigroupby_command
    group: (multigroupby_group
      grouping: (aliased_expression
        expression: (key)))
      aggregation: (aliased_expression
        expression: (call_expression
          function: (key)
          arguments: (arguments))
        alias: (key))
      aggregation: (aliased_expression
        expression: (call_expression
          function: (key)
          arguments: (arguments))
        alias: (key))))
