=======
orderby
=======

orderby key

---

(query
  (orderby_command
    key: (key
      (identifier))))

============
orderby desc
============

orderby key desc

---

(query
  (orderby_command
    key: (key
      (identifier))))

===========
orderby asc
===========

orderby key asc

---

(query
  (orderby_command
    key: (key
      (identifier))))

=====================
orderby multiple keys
=====================

orderby key, key2, key3

---

(query
  (orderby_command
    key: (key
      (identifier))
    key: (key
      (identifier))
    key: (key
      (identifier))))

============
sortby alias
============

sortby key

---

(query
  (orderby_command
    key: (key
      (identifier))))

==============
order by alias
==============

order by key

---

(query
  (orderby_command
    key: (key
      (identifier))))

=============
sort by alias
=============

sort by key

---

(query
  (orderby_command
    key: (key
      (identifier))))
