=======
orderby
=======

orderby key

---

(query
  (orderby_command
    key: (key)))

============
orderby desc
============

orderby key desc

---

(query
  (orderby_command
    key: (key)))

===========
orderby asc
===========

orderby key asc

---

(query
  (orderby_command
    key: (key)))

=====================
orderby multiple keys
=====================

orderby key, key2, key3

---

(query
  (orderby_command
    key: (key)
    key: (key)
    key: (key)))

============
sortby alias
============

sortby key

---

(query
  (orderby_command
    key: (key)))

==============
order by alias
==============

order by key

---

(query
  (orderby_command
    key: (key)))

=============
sort by alias
=============

sort by key

---

(query
  (orderby_command
    key: (key)))
