======
remove
======

remove path

---

(query
  (remove_command
    keypath: (key)))

====================
remove with subpaths
====================

remove $p.sub1.sub2

---

(query
  (remove_command
    keypath: (field_expression
      expression: (field_expression
        expression: (key)
        field: (field))
      field: (field))))

========================
remove multiple keypaths
========================

remove path, path2, path3

---

(query
  (remove_command
    keypath: (key)
    keypath: (key)
    keypath: (key)))

=======
r alias
=======

r path

---

(query
  (remove_command
    keypath: (key)))
