=========
roundtime
=========

roundtime to 1h

---

(query
  (roundtime_command
    interval: (interval)))

=====================
roundtime with source
=====================

roundtime source to 1h

---

(query
  (roundtime_command
    source: (key)
    interval: (interval)))

=====================
roundtime with expression source
=====================

roundtime @'now' to 1h

---

(query
  (roundtime_command
    source: (timestamp_literal
      (string))
    interval: (interval)))

===================
roundtime with into
===================

roundtime to 1h into key

---

(query
  (roundtime_command
    interval: (interval)
    into: (key)))

==============================
roundtime with source and into
==============================

roundtime source to 1h into key

---

(query
  (roundtime_command
    source: (key)
    interval: (interval)
    into: (key)))
